<template>
  <div class="container mx-auto md:mt-24 mt-8">
    <section class="bg-white md:m-5 md:p-5 m-2 p-2 rounded-lg">
      <div class="my-5">
        <h1 class="md:text-3xl text-lg font-bold mb-3 text-center">利用規約</h1>
        <p class="mb-2 md:ml-4 ml-2 md:text-base text-xs">
          この利用規約(以下、「本規約」といいます。)は、運営者がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。本規約は、本サービスを利用するすべてのユーザーに適用されます。
        </p>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第1条（適用）</h2>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>本規約は，ユーザーと運営者と本サービスの利用に関わる一切の関係に適用されるものとします。</li>
          <li>運営者は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。</li>
          <li>本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第2条（利用登録）</h2>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>本サービスにおいては、登録希望者が本規約に同意の上、運営者の定める方法によって利用登録を申請し、運営者がこれを承認することによって、利用登録が完了するものとします。</li>
          <li>運営者は、利用登録の申請者に以下の事由があると判断した場合、利用登録の申請を承認しないことがあり、その理由については一切の開示義務を負わないものとします。</li>
          <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
            <li class="mb-1">利用登録の申請に際して虚偽の事項を届け出た場合</li>
            <li class="mb-1">本規約に違反したことがある者からの申請である場合</li>
            <li class="mb-1">その他，運営者が利用登録を相当でないと判断した場合</li>
          </ul>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第3条（ユーザーIDおよびパスワードの管理）</h2>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>ユーザーは、自己の責任において、本サービスのユーザーIDおよびパスワードを適切に管理するものとします。</li>
          <li>ユーザーは、いかなる場合にも、ユーザーIDおよびパスワードを第三者に譲渡または貸与し、もしくは第三者と共用することはできません。運営者は、ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には、そのユーザーIDを登録しているユーザー自身による利用とみなします。</li>
          <li>ユーザーID及びパスワードが第三者によって使用されたことによって生じた損害は、運営者に故意又は重大な過失がある場合を除き、運営者は一切の責任を負わないものとします。</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">
          第4条（未成年による利用）
        </h2>
        <p class="mb-2 md:ml-4 ml-2 md:text-base text-xs">
          ユーザーが未成年である場合には、法定代理人の同意を得た上で、本サービスを利用してください。
          法定代理人の同意を得ずに本サービスのご利用を開始したユーザーが成年に達した場合、未成年者であった間の利用行為を追認したものとみなします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">
          第5条（コンテンツのご利用）
        </h2>
        <p class="mb-2 md:ml-4 ml-2 md:text-base text-xs">
          運営者は、ユーザーに対し、本サービスが提供する文章、画像、動画、音声、音楽、ソフトウェア、プログラム、コードその他のコンテンツについて、本サービスの利用範囲内における私的な利用を許諾します。有償コンテンツについては、運営者が定める利用料金の支払が完了した場合に、本サービスの利用範囲内における私的な利用を許諾します。これは、譲渡及び再許諾できない、非独占的な利用権です。この範囲を超えて本サービスが提供するコンテンツを利用することは一切禁止します。
          理由の如何を問わず、ユーザーが本サービスを利用する権利を失った場合、本サービスの一切のコンテンツの利用ができなくなることを、ユーザーは予め承諾するものとします。
        </p>
      </div>
      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">
          第6条（禁止事項）
        </h2>
        <p class="mb-2 md:ml-4 ml-2 md:text-base text-xs">ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>法令または公序良俗に違反する行為</li>
          <li>犯罪行為に関連する行為</li>
          <li>運営者、本サービスの他のユーザー、または第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
          <li>運営者のサービスの運営を妨害するおそれのある行為</li>
          <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
          <li>不正アクセスをし、またはこれを試みる行為</li>
          <li>逆アセンブル、逆コンパイル、リバースエンジニアリング等によって本サービスのソースコードを解析する行為</li>
          <li>本サービスに接続しているシステムに権限なく不正にアクセスし又は当局設備に蓄積された情報を不正に書き換え若しくは消去する行為</li>
          <li>他のユーザーに成りすます行為</li>
          <li>運営者のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</li>
          <li>運営者，本サービスの他のユーザーまたは第三者の知的財産権，肖像権，プライバシー，名誉その他の権利または利益を侵害する行為</li>
          <li>以下の表現を含み，または含むと運営者が判断する内容を本サービス上に投稿し，または送信する行為</li>
          <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
            <li class="mb-1">過度に暴力的な表現</li>
            <li class="mb-1">露骨な性的表現</li>
            <li class="mb-1">人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現</li>
            <li class="mb-1">自殺，自傷行為，薬物乱用を誘引または助長する表現</li>
            <li class="mb-1">その他反社会的な内容を含み他人に不快感を与える表現</li>
          </ul>
          <li>以下を目的とし，または目的とすると運営者が判断する行為</li>
          <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
            <li class="mb-1">営業，宣伝，広告，勧誘，その他営利を目的とする行為（運営者の認めたものを除きます。）</li>
            <li class="mb-1">性行為やわいせつな行為を目的とする行為</li>
            <li class="mb-1">面識のない異性との出会いや交際を目的とする行為</li>
            <li class="mb-1">他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為</li>
            <li class="mb-1">運営者，本サービスの他のユーザー，または第三者に不利益，損害または不快感を与えることを目的とする行為</li>
            <li class="mb-1">その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為</li>
          </ul>
          <li>宗教活動または宗教団体への勧誘行為</li>
          <li>歩行中、車両運転中、その他本サービスの利用が不適切な状況又は態様において本サービスを利用する行為</li>
          <li>その他、管理者が不適切と判断する行為</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">
          第7条（本サービスの提供の停止等）
        </h2>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>運営者は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。</li>
          <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
            <li class="mb-1">本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
            <li class="mb-1">地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合</li>
            <li class="mb-1">コンピュータまたは通信回線等が事故により停止した場合</li>
            <li class="mb-1">その他，運営者が本サービスの提供が困難と判断した場合</li>
          </ul>
          <li>運営者は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">
          第8条（著作権）
        </h2>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>ユーザーは，自ら著作権等の必要な知的財産権を有するか，または必要な権利者の許諾を得た文章，画像や等の情報に関してのみ，本サービスを利用し，投稿ないしアップロードすることができるものとします。</li>
          <li>ユーザーが本サービスを利用して投稿ないしアップロードした文章，画像，等の著作権については，当該ユーザーその他既存の権利者に留保されるものとします。ただし，運営者は，本サービスを利用して投稿ないしアップロードされた文章，画像，等について，本サービスの改良，品質の向上，または不備の是正等ならびに本サービスの周知宣伝等に必要な範囲で利用できるものとし，ユーザーは，この利用に関して，著作者人格権を行使しないものとします。</li>
          <li>前項本文の定めるものを除き，本サービスおよび本サービスに関連する一切の情報についての著作権およびその他の知的財産権はすべて運営者または運営者にその利用を許諾した権利者に帰属し，ユーザーは無断で複製，譲渡，貸与，翻訳，改変，転載，公衆送信（送信可能化を含みます。），伝送，配布，出版，営業使用等をしてはならないものとします。</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第9条（利用制限および登録抹消）</h2>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>運営者は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，投稿データを削除し，ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができるものとします。</li>
          <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
            <li class="mb-1">本規約のいずれかの条項に違反した場合</li>
            <li class="mb-1">登録事項に虚偽の事実があることが判明した場合</li>
            <li class="mb-1">運営者からの連絡に対し，一定期間返答がない場合</li>
            <li class="mb-1">その他，運営者が本サービスの利用を適当でないと判断した場合</li>
          </ul>
          <li>前項各号のいずれかに該当した場合，ユーザーは，当然に運営者に対する一切の債務について期限の利益を失い，その時点において負担する一切の債務を直ちに一括して弁済しなければなりません。</li>
          <li>運営者は，本条に基づき運営者が行った行為によりユーザーに生じた損害について，一切の責任を負いません。</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">
          第10条（保証の否認および免責事項）
        </h2>
        <ul class="md:ml-4 ml-2 p-4 list-decimal md:text-base text-xs">
          <li>運営者は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
          <li>運営者は，本サービスに起因してユーザーに生じたあらゆる損害について、運営者の故意又は重過失による場合を除き、一切の責任を負いません。ただし，本サービスに関する運営者とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。</li>
          <li>前項ただし書に定める場合であっても，運営者は，運営者の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（運営者またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。また，運営者の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は，ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。</li>
          <li>運営者は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第11条（サービス内容の変更等）</h2>
        <p class="md:ml-4 ml-2 md:text-base text-xs">
          運営者は，ユーザーへの事前の告知をもって、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第12条（利用規約の変更）</h2>
        <p class="md:ml-4 ml-2 md:text-base text-xs">
          運営者は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，ユーザーは変更後の規約に同意したものとみなします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第13条（個人情報の取扱い）</h2>
        <p class="md:ml-4 ml-2 md:text-base text-xs">
          運営者は，本サービスの利用によって取得する個人情報については，運営者「プライバシーポリシー」に従い適切に取り扱うものとします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="md:text-xl text-sm font-bold">第14条（準拠法・裁判管轄）</h2>
        <p class="md:ml-4 ml-2 md:text-base text-xs">
          本規約の解釈にあたっては、日本法を準拠法とします。
        </p>
        <p class="md:ml-4 ml-2 md:text-base text-xs">
          本サービスに関して紛争が生じた場合には、当局の本店所在地を管轄する地方裁判所を専属的合意管轄とします。
        </p>
      </div>

      <div class="my-5">
        <p class="p-0 text-right md:text-base text-xs">以上</p>
        <p class="p-0 md:text-base text-xs">2022年08月15日 制定</p>
      </div>
    </section>
  </div>
</template>
